run/pressureBuildupFoam/SummerExample_b/0/mu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
5000
(
925926
925926
925926
925926
925926
925926
925926
925926
...
)
;

boundaryField
{
    seaBed
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
925926
925926
925926
925926
925926
925926
925926
925926
...
)
;
    }
    frontBack
    {
        type            empty;
    }
    soilDomainBottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
925926
925926
925926
925926
925926
925926
925926
925926
...
)
;
    }
    sides
    {
        type            cyclic;
        value           uniform 925926;
    }
}


// ************************************************************************* //
